Ale-maker325/firmware/variants/nrf52840/diy/nRF52840_Ebyte_modems/variant.h
#ifndef _VARIANT_PROMICRO_DIY_
#define _VARIANT_PROMICRO_DIY_

/** Частота опорного генератора схемы синхронизации микроконтроллера (Master clock) */
#define VARIANT_MCK (64000000ul)

// Настройка источника низкочастотного тактирования (LF)
// #define USE_LFXO // Раскомментировать, если на плате установлен внешний кварцевый резонатор 32 кГц
#define USE_LFRC // Плата использует внутреннюю RC-цепочку микроконтроллера для низких частот

#define PROMICRO_DIY_TCXO

/*----------------------------------------------------------------------------
 * Заголовки системных определений
 *----------------------------------------------------------------------------*/

#include "WVariant.h"

#ifdef __cplusplus
extern "C" {
#endif // __cplusplus

/*
НАЗНАЧЕНИЕ ПИНОВ ДЛЯ МИКРОКОНТРОЛЛЕРА NRF52 PRO MICRO (ФИЗИЧЕСКАЯ СХЕМА ПОДКЛЮЧЕНИЯ)

| Pin   | Функция МК   |     | Pin      | Функция      | RF95 (E32) |
| ----- | ----------- | --- | -------- | ------------ | ---------- |
| Gnd   | Земля       |     | vbat     | Питание бат. |            |
| P0.06 | Serial2 RX  |     | vbat     | Питание бат. |            |
| P0.08 | Serial2 TX  |     | Gnd      | Земля        |            |
| Gnd   | Земля       |     | reset    | Сброс МК     |            |
| Gnd   | Земля       |     | ext_vcc  | Питание пер. | *см. P0.13 |
| P0.17 | RXEN        |     | P0.31    | BATTERY_PIN  | RX_EN      |
| P0.20 | GPS_RX      |     | P0.29    | BUSY / DIO0  | BUSY (DIO0)|
| P0.22 | GPS_TX      |     | P0.02    | MISO         | MISO       |
| P0.24 | GPS_EN      |     | P1.15    | MOSI         | MOSI       |
| P1.00 | BUTTON_PIN  |     | P1.13    | CS           | CS         |
| P0.11 | SCL         |     | P1.11    | SCK          | SCK        |
| P1.04 | SDA         |     | P0.10    | DIO1/IRQ     | DIO1       |
| P1.06 | TXEN        |     | P0.09    | RESET        | RST        |
|       |             |     |          |              |            |
|       | Середина    |     |          | Внутренние   |            |
| P1.01 | Свободный   |     | 0.15     | LED          |            |
| P1.02 | Свободный   |     | 0.13     | 3V3_EN       |            |
| P1.07 | Свободный   |     |          |              |            |
*/

// Общее количество цифровых и аналоговых выводов, определенных в системе
#define PINS_COUNT (48)
#define NUM_DIGITAL_PINS (48)
#define NUM_ANALOG_INPUTS (1)
#define NUM_ANALOG_OUTPUTS (0)

// Управление питанием периферии 3.3V (Вывод P0.13 должен оставаться активным для питания LoRa)
#define PIN_3V3_EN (0 + 13) // P0.13

// Конфигурация аналоговых пинов для измерения напряжения батареи
#define BATTERY_PIN (0 + 31) // Вывод P0.31 служит входом АЦП контроля батареи
#define ADC_CHANNEL ADC1_GPIO4_CHANNEL
#define ADC_RESOLUTION 14
#define BATTERY_SENSE_RESOLUTION_BITS 12
#define BATTERY_SENSE_RESOLUTION 4096.0

// Расчет параметров АЦП: диапазон 3.0V при разрешении 12-бит = 3000мВ / 4096
#define VBAT_MV_PER_LSB (0.73242188F)
// Параметры делителя напряжения на плате: резисторы 1.5M и 1M => (1.5M / (1M + 1.5M))
#define VBAT_DIVIDER (0.6F)
// Коэффициент компенсации погрешности делителя напряжения
#define VBAT_DIVIDER_COMP (1.73)
// Итоговый расчет цены деления АЦП в милливольтах с учетом компенсации
#define REAL_VBAT_MV_PER_LSB (VBAT_DIVIDER_COMP * VBAT_MV_PER_LSB)
#undef AREF_VOLTAGE
#define AREF_VOLTAGE 3.0
#define VBAT_AR_INTERNAL AR_INTERNAL_3_0
#define ADC_MULTIPLIER VBAT_DIVIDER_COMP 
#define VBAT_RAW_TO_SCALED(x) (REAL_VBAT_MV_PER_LSB * x)

// Конфигурация аппаратного интерфейса I2C (Шина Wire)
#define WIRE_INTERFACES_COUNT 1
#define PIN_WIRE_SDA (32 + 4) // Линия данных SDA назначена на вывод P1.04
#define PIN_WIRE_SCL (0 + 11) // Линия тактирования SCL назначена на вывод P0.11

// Параметры встроенного системного светодиода
#define PIN_LED1 (0 + 15) // Вывод P0.15 (физически красный светодиод на плате)
#define LED_BUILTIN PIN_LED1
#define LED_BLUE PIN_LED1
#define LED_STATE_ON 1 // Уровень логической единицы включает светодиод

// Конфигурация аппаратной кнопки управления пользовательского интерфейса
#define BUTTON_PIN (32 + 0) // Вывод P1.00

// Конфигурация интерфейса подключения GPS-модуля
#define PIN_GPS_TX (0 + 22) // Вывод P0.22 (Передача данных со стороны МК к GPS)
#define PIN_GPS_RX (0 + 20) // Вывод P0.20 (Прием данных МК от GPS модуля)
#define PIN_GPS_EN (0 + 24) // Вывод P0.24 (Управление ключом питания GPS-модуля)
#define GPS_UBLOX

// Конфигурация аппаратных интерфейсов UART (последовательные порты)
#define PIN_SERIAL1_RX PIN_GPS_TX
#define PIN_SERIAL1_TX PIN_GPS_RX
#define PIN_SERIAL2_RX (0 + 6) // Вывод P0.06
#define PIN_SERIAL2_TX (0 + 8) // Вывод P0.08

// Конфигурация аппаратной шины SPI для обмена данными с LoRa модемом
#define SPI_INTERFACES_COUNT 1
#define PIN_SPI_MISO (0 + 2)   // Линия ввода данных SPI на выводе P0.02
#define PIN_SPI_MOSI (32 + 15) // Линия вывода данных SPI на выводе P1.15
#define PIN_SPI_SCK (32 + 11)  // Линия тактирования шины SPI на выводе P1.11

// Системные привязки линий SPI, используемые ядром связи прошивки
#define LORA_MISO PIN_SPI_MISO
#define LORA_MOSI PIN_SPI_MOSI
#define LORA_SCK PIN_SPI_SCK
#define LORA_CS (32 + 13) // Вывод выбора кристалла трансивера CS на P1.13

// ============================================================================
// ПОДДЕРЖИВАЕМЫЕ СЕРИИ LORA МОДЕМОВ В СИСТЕМЕ
// ============================================================================
//#define USE_LLCC68
//#define USE_SX1262
#define USE_RF95 // Данный дефайн активирует блок настроек под ваш текущий чип SX1278 (E32)
//#define USE_SX1268
//#define USE_LR1121

// ----------------------------------------------------------------------------
// АКТУАЛЬНАЯ КОНФИГУРАЦИЯ: Блок настроек для RF95 / SX127x (Модем E32)
// ----------------------------------------------------------------------------
#define LORA_DIO0 (0 + 29) // Вывод P0.29 — Линия BUSY / Аппаратное прерывание пакетов (DIO0 модема)
#define LORA_DIO1 (0 + 10) // Вывод P0.10 — Аппаратное прерывание таймаутов (DIO1 модема)
#define LORA_RESET (0 + 9) // Вывод P0.09 — Линия аппаратного сброса трансивера (RST модема)

// Конфигурация раздельного управления внешним РЧ-переключателем трансивера E32
#define RF95_RXEN (0 + 17) // Вывод P0.17 — Управление линией приема RX_EN (высокий уровень активирует прием пакетов)
#define RF95_TXEN (32 + 6) // Вывод P1.06 — Управление линией передачи TX_EN (свободный пин боковой гребенки)

// ----------------------------------------------------------------------------
// РЕЗЕРВНАЯ КОНФИГУРАЦИЯ: Блок настроек для серии SX126X
// ----------------------------------------------------------------------------
#define SX126X_CS (32 + 13)      // Линия CS на выводе P1.13
#define SX126X_DIO1 (0 + 10)     // Линия прерывания IRQ на выводе P0.10
#define SX126X_DIO2_AS_RF_SWITCH // Автоматическое переключение РЧ через внутренний DIO2 самого чипа
#define SX126X_BUSY (0 + 29)     // Контроль состояния занятости BUSY на выводе P0.29
#define SX126X_RESET (0 + 9)     // Линия сброса на выводе P0.09
#define SX126X_RXEN (0 + 17)     // Линия приема RX_EN на выводе P0.17
#define SX126X_TXEN RADIOLIB_NC  // Для чипов SX126x управление передачей осуществляется аппаратно через DIO2

// ----------------------------------------------------------------------------
// РЕЗЕРВНАЯ КОНФИГУРАЦИЯ: Блок настроек для серии LR1121
// ----------------------------------------------------------------------------
#ifdef USE_LR1121
#define LR1121_IRQ_PIN (0 + 10)      // Прерывание на P0.10
#define LR1121_NRESET_PIN LORA_RESET // Сброс трансивера на P0.09
#define LR1121_BUSY_PIN (0 + 29)     // Контроль занятости BUSY на P0.29
#define LR1121_SPI_NSS_PIN LORA_CS   // Выбор чипа CS на P1.13
#define LR1121_SPI_SCK_PIN LORA_SCK
#define LR1121_SPI_MOSI_PIN LORA_MOSI
#define LR1121_SPI_MISO_PIN LORA_MISO
#define LR11X0_DIO3_TCXO_VOLTAGE 1.8
#define LR11X0_DIO_AS_RF_SWITCH
#endif

// Настройка питания внешнего высокостабильного генератора (TCXO) для совместимых модулей
#define SX126X_DIO3_TCXO_VOLTAGE 1.8
#define TCXO_OPTIONAL // Позволяет прошивке на лету пробовать запускать радиомодули как с TCXO, так и с XTAL кварцем


#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------
 * Объекты среды Arduino - только для С++ компилятора
 *----------------------------------------------------------------------------*/

#endif // _VARIANT_PROMICRO_DIY_